In [14]:
import pandas as pd 
import numpy as np

In [15]:
df = pd.read_csv('analysis_data_with_missing.csv')
df.head()

    age   salary  gender    city  experience_years
0   NaN  23343.0    Male  Mumbai               NaN
1  69.0  33500.0    Male  Nagpur               1.0
2  46.0      NaN    Male   Delhi               0.0
3  32.0  49375.0  Female  Nagpur               0.0
4  60.0  29662.0    Male   Delhi               NaN

In [16]:
df.isnull().mean() * 100

age                 10.0
salary              10.0
gender              10.0
city                10.0
experience_years    10.0
dtype: float64

In [17]:
from sklearn.impute import SimpleImputer 
from sklearn.compose import ColumnTransformer

In [18]:
cat_values = SimpleImputer(strategy='most_frequent')
num_values = SimpleImputer(strategy='median')

Ctf = ColumnTransformer([
    ('cat_values', cat_values, ['gender', 'city']), 
    ('num_values', num_values, ['age', 'salary', 'experience_years'])
], remainder='passthrough')

In [19]:
Ctf = Ctf.fit_transform(df)
Ctf

array([['Male', 'Mumbai', 45.0, 23343.0, 9.0],
       ['Male', 'Nagpur', 69.0, 33500.0, 1.0],
       ['Male', 'Delhi', 46.0, 78079.0, 0.0],
       ...,
       ['Female', 'Pune', 57.0, 90390.0, 14.0],
       ['Other', 'Pune', 62.0, 72329.0, 4.0],
       ['Female', 'Nashik', 45.0, 142418.0, 19.0]], dtype=object)

In [21]:
df = pd.DataFrame(
    Ctf, 
    columns=['gender', 'city', 'age', 'salary', 'experience_years']
)
df

     gender    city   age    salary experience_years
0      Male  Mumbai  45.0   23343.0              9.0
1      Male  Nagpur  69.0   33500.0              1.0
2      Male   Delhi  46.0   78079.0              0.0
3    Female  Nagpur  32.0   49375.0              0.0
4      Male   Delhi  60.0   29662.0              9.0
..      ...     ...   ...       ...              ...
495   Other  Nashik  65.0  139803.0              2.0
496   Other  Mumbai  42.0   90173.0             10.0
497  Female    Pune  57.0   90390.0             14.0
498   Other    Pune  62.0   72329.0              4.0
499  Female  Nashik  45.0  142418.0             19.0

[500 rows x 5 columns]

In [22]:
df.isnull().mean()

gender              0.0
city                0.0
age                 0.0
salary              0.0
experience_years    0.0
dtype: float64

In [23]:
df.head()

   gender    city   age   salary experience_years
0    Male  Mumbai  45.0  23343.0              9.0
1    Male  Nagpur  69.0  33500.0              1.0
2    Male   Delhi  46.0  78079.0              0.0
3  Female  Nagpur  32.0  49375.0              0.0
4    Male   Delhi  60.0  29662.0              9.0

In [25]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(
    df.drop('salary', axis=1), 
    df['salary'], 
    test_size=0.2, 
    random_state=2
)
x_train.shape, x_test.shape

((400, 4), (100, 4))

In [27]:
x_train.head()

     gender    city   age experience_years
428   Other  Nagpur  30.0              5.0
490   Other  Mumbai  18.0              2.0
53    Other  Nashik  43.0             18.0
336  Female  Nagpur  50.0             12.0
154   Other    Pune  59.0             14.0